# MacroModule Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
MacroModule Methods
MacroModule Class See Also
---
The MacroModule type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AddMacro | Adds a macro to the module. |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetBasicIEnumerator | Returns an enumerator that iterates through a collection. |
| GetEnumerator | Returns an enumerator that iterates through a collection. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetMacro | Gets the macro with the give name. |
| GetMacroModuleIterator | Returns a Macro module iterator that iterates through the collection. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| RemoveMacro | Removes a macro from the module. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
MacroModule Class
Autodesk.Revit.DB.Macros Namespace